# Topic:        Challenge Set 9, part 2
# Subject:      Pandas Challenges
# Date:         02/21/2017
# Name:         Rosie Hoyem

In [1]:
from sqlalchemy import create_engine
import pandas as pd
cnx = create_engine('postgresql://rosiehoyem:flyingpig@52.14.118.196:5432/rosiehoyem')

In [2]:
schema = pd.read_sql_query('''SELECT * FROM INFORMATION_SCHEMA.TABLES''',cnx)

In [3]:
schema.head()

,table_catalog,table_schema,table_name,table_type,self_referencing_column_name,reference_generation,user_defined_type_catalog,user_defined_type_schema,user_defined_type_name,is_insertable_into,is_typed,commit_action
0,rosiehoyem,public,ewoks,BASE TABLE,None,None,None,None,None,YES,NO,None
1,rosiehoyem,public,allstarfull,BASE TABLE,None,None,None,None,None,YES,NO,None
2,rosiehoyem,public,salaries,BASE TABLE,None,None,None,None,None,YES,NO,None
3,rosiehoyem,public,schools,BASE TABLE,None,None,None,None,None,YES,NO,None
4,rosiehoyem,pg_catalog,pg_statistic,BASE TABLE,None,None,None,None,None,YES,NO,None

In [4]:
pd.read_sql_query('''SELECT * FROM allstarfull LIMIT 5''',cnx)

    playerid  yearid gamenum        gameid teamid lgid gp startingpos
0  gomezle01    1933       0  ALS193307060    NYA   AL  1           1
1  ferreri01    1933       0  ALS193307060    BOS   AL  1           2
2  gehrilo01    1933       0  ALS193307060    NYA   AL  1           3
3  gehrich01    1933       0  ALS193307060    DET   AL  1           4
4  dykesji01    1933       0  ALS193307060    CHA   AL  1           5

In [5]:
pd.read_sql_query('''SELECT * FROM salaries LIMIT 5''',cnx)

   yearid teamid lgid   playerid     salary
0    1985    BAL   AL  murraed02  1472819.0
1    1985    BAL   AL   lynnfr01  1090000.0
2    1985    BAL   AL  ripkeca01   800000.0
3    1985    BAL   AL   lacyle01   725000.0
4    1985    BAL   AL  flanami01   641667.0

In [30]:
pd.read_sql_query('''SELECT * FROM schools LIMIT 5''',cnx)

,schoolid,schoolname,schoolcity,schoolstate,schoolnick
0,abilchrist,Abilene Christian University,Abilene,TX,Wildcats
1,adelphi,Adelphi University,Garden City,NY,Panthers
2,adrianmi,Adrian College,Adrian,MI,Bulldogs
3,airforce,United States Air Force Academy,Colorado Springs,CO,Falcons
4,akron,University of Akron,Akron,OH,Zips

### 1. What was the total spent on salaries by each team, each year?

In [6]:
pd.read_sql_query('''
SELECT teamid, yearid, SUM(salary) AS total_salary
FROM salaries 
GROUP BY teamid, yearid
ORDER BY total_salary DESC;
''',cnx).head()

  teamid  yearid  total_salary
0    NYA    2013   231978886.0
1    LAN    2013   223362196.0
2    NYA    2005   208306817.0
3    NYA    2008   207896789.0
4    NYA    2010   206333389.0

### 2. What is the first and last year played for each player? Hint: Create a new table from 'Fielding.csv'.

In [25]:
pd.read_sql_query('''
CREATE TABLE years_played
    (playerid CHAR(12), yearid_first INT, yearid_last INT);
SELECT * FROM years_played;
''',cnx)

Empty DataFrame
Columns: [playerid, yearid_first, yearid_last]
Index: []

In [27]:
pd.read_sql_query('''
INSERT into years_played
SELECT playerid, MIN(yearid) AS yearid_first, MAX(yearid) AS yearid_last
FROM allstarfull
GROUP BY playerid;
SELECT * FROM years_played;
''',cnx).head()

       playerid  yearid_first  yearid_last
0  ramospe01             1959         1959
1  pinielo01             1972         1972
2  mintogr01             1982         1982
3  contrjo01             2006         2006
4  boyerke01             1956         1964

### 3. Who has played the most all star games?

In [29]:
pd.read_sql_query('''
SELECT playerid, COUNT(gameid) AS total_games
FROM allstarfull 
GROUP BY playerid
ORDER BY total_games DESC;
''',cnx).head()

    playerid  total_games
0  aaronha01           25
1  musiast01           24
2   mayswi01           24
3  mantlmi01           20
4  willite01           19

### 4. Which school has generated the most distinct players? Hint: Create new table from 'CollegePlaying.csv'.

### 5. Which players have the longest career? Assume that the debut and finalGame columns comprise the start and end, respectively, of a player's career. Hint: Create a new table from 'Master.csv'. Also note that strings can be converted to dates using the DATE function and can then be subtracted from each other yielding their difference in days.

### 6. What is the distribution of debut months? Hint: Look at the DATE and EXTRACT functions.

### 7. What is the effect of table join order on mean salary for the players listed in the main (master) table? Hint: Perform two different queries, one that joins on playerID in the salary table and other that joins on the same column in the master table. You will have to use left joins for each since right joins are not currently supported with SQLalchemy.